app/controllers/events_controller.rb

  def index
     @events = Event.search(params[:search])
---
SELECT `events`.* FROM `events` WHERE (event_name like '%kalika%')

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`event_name`, `start_date`, `end_date`, `address`, `latitude`, `longitude`, `organizer`, `detail`, `created_at`, `updated_at`) VALUES ('Futsal Tournament', '2017-07-27', '2017-07-31', 'Lazimpath', 80.55, 40.22, 'Amir team', 'its an annual event', '2017-07-27 03:41:13', '2017-07-27 03:41:13')

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE `events` SET `address` = 'Radisson Hotel Kathmandu, Kathmandu 44600', `latitude` = 27.7202008, `longitude` = 85.32124519999999, `updated_at` = '2017-07-27 17:27:10' WHERE `events`.`id` = 13

  def destroy
    @event.destroy
---
DELETE FROM `events` WHERE `events`.`id` = 1

    def set_event
      @event = Event.find(params[:id])
---
SELECT events.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((27.7202 - events.latitude) * PI() / 180 / 2), 2) + COS(27.7202 * PI() / 180) * COS(events.latitude * PI() / 180) * POWER(SIN((85.3212 - events.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((events.longitude - 85.3212) / 57.2957795), ((events.latitude - 27.7202) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `events` WHERE (events.latitude BETWEEN 27.57546821688915 AND 27.864931783110848 AND events.longitude BETWEEN 85.15770369488158 AND 85.48469630511843 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((27.7202 - events.latitude) * PI() / 180 / 2), 2) + COS(27.7202 * PI() / 180) * COS(events.latitude * PI() / 180) * POWER(SIN((85.3212 - events.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 10 AND events.id != 13) ORDER BY distance ASC