app/controllers/home_controller.rb

  def index

    @posts = Event.all
---
SELECT `events`.* FROM `events`